<?php

namespace App\Exports;

use App\Models\Teacher;
use Maatwebsite\Excel\Concerns\FromCollection;
use Maatwebsite\Excel\Concerns\WithHeadings;

class TeacherExport implements FromCollection,WithHeadings
{
    /**
    * @return \Illuminate\Support\Collection
    */
    public function collection()
    {
        return Teacher::all();
    }

    public function headings(): array
    {
        return [
            'ID',
            'كود المعلم',
            'اسم المعلم',
            'رقم السجل',
            'رقم البطاقه',
            'النوع',
            'كود النوع',
            'الموقف من العمل',
            'كود الموقف من العمل',
            'المنطقه',
            'كود المنطقه',
            'الاداره',
            'كود الاداره',
            'المعهد',
            'كود المعهد',
            'معهد اخر',
            'كود المعهد الاخر',
            'مادة التخصص',
            'كود مادة التخصص',
            'مادة التخصص 1 ',
            '1 كود مادة التخصص',
            '2 مادة التخصص',
            '2 كود مادة التخصص',
            'الدرجة',
            'كود الدرجة',
            'تاريخ الحصول على الدرجة',
            'نوع التعيين',
            'تاريخ التعيين',
            'تاريخ  استلام العمل',
            'المجموعة النوعية',
            'كود المجموعة النوعية',
            'الوظيفة على الكارد',
            'كود الوظيفة على الكادر',
            'تاريخ قرار الوظيفة على الكارد',
            'رقم قرار الوظيفة على الكارد',
            'اسم المؤهل',
            'كود المؤهل',
            'نوع المؤهل',
            'تاريخ الحصول على المؤهل',
            'اسم الوظيفة',
            'كود الوظيفة',
            'الكفاءة',
            'كود  الكفاءة',
        ];
    }
}
